import Block from '@scomponents/Block'
import Title from '@components/Title'
import Button from '@components/Button'
import InfoItem from '@components/InfoItem'

const WhyWeBlock = () => (
  <div className="relative bg-bg">
    <div className="absolute top-0 w-full overflow-hidden">
      <svg
        style={{
          width: '150%',
          height: '0.75vw',
          fill: 'rgb(255, 255, 255)',
          transform: 'scaleY(-1)',
        }}
        xmlns="http://www.w3.org/2000/svg"
        viewBox="0 0 1000 10"
        preserveAspectRatio="none"
      >
        <path d="M992 8.2L983.8 0l-8.2 8.2-8.2-8.2-8.2 8.2L951 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L869 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L787 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L705 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L623 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L541 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L459 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L377 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L295 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L213 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L131 0l-8.2 8.2-8.2-8.2-8.2 8.2L98.2 0 90 8.2 81.8 0l-8.2 8.2L65.4 0l-8.2 8.2L49 0l-8.2 8.2L32.6 0l-8.2 8.2L16.2 0 8 8.2-.2 0v10h1000.4V0"></path>
      </svg>
    </div>
    <div className="absolute bottom-0 w-full overflow-hidden">
      <svg
        style={{
          width: '150%',
          height: '0.75vw',
          fill: 'rgb(255, 255, 255)',
        }}
        xmlns="http://www.w3.org/2000/svg"
        viewBox="0 0 1000 10"
        preserveAspectRatio="none"
      >
        <path d="M992 8.2L983.8 0l-8.2 8.2-8.2-8.2-8.2 8.2L951 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L869 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L787 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L705 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L623 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L541 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L459 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L377 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L295 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L213 0l-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2-8.2-8.2-8.2 8.2L131 0l-8.2 8.2-8.2-8.2-8.2 8.2L98.2 0 90 8.2 81.8 0l-8.2 8.2L65.4 0l-8.2 8.2L49 0l-8.2 8.2L32.6 0l-8.2 8.2L16.2 0 8 8.2-.2 0v10h1000.4V0"></path>
      </svg>
    </div>
    <img
      className="absolute h-full bg-cover opacity-15"
      src="img/map.png"
      alt="map"
      // width={100}
      height="100%"
    />
    <Block className="z-10 py-36">
      <div className="flex justify-between">
        <Title title="Почему Красноярцы выбирают нас" white />
        <Button name="Каталог шаров" className="mt-6" />
      </div>
      <div className="grid justify-around grid-cols-1 mt-8 gap-y-16 tablet:grid-cols-2 laptop:grid-cols-3 gap-x-4">
        {/* <div className="flex justify-around grid-cols-1 tablet:grid-cols-2 laptop:grid-cols-3 gap-x-1 gap-y-2"> */}
        <InfoItem
          text="У нас большой выбор шаров на любой вкус и цвет, для любого события"
          src="icons/ballons_1.png"
        />
        <InfoItem
          text="Мы НЕ используем дешёвые китайские шары, которые могут вызвать аллергию"
          src="icons/cancel.png"
        />
        <InfoItem
          text="Мы обрабатываем шары специальным составом, чтобы они летали дольше"
          src="icons/paint-spray.webp"
        />
        <InfoItem
          text="Мы привозим качественные шары из Колумбии, Турции, Малайзии и Испании"
          src="icons/earth.png"
        />
        <InfoItem
          text="Перед доставкой клиентам мы проверяем каждый шарик на наличие брака"
          src="icons/check_1.png"
        />
        <InfoItem
          text="Мы круглосуточно доставляем шары по Красноярску нашим клиентам"
          src="icons/delivery-truck_2_.png"
        />
      </div>
    </Block>
  </div>
)

export default WhyWeBlock
